{
  "policies": [
    {
      "id": "economic-freedom",
      "slug": "economic-freedom",
      "title": "Economic Freedom & Anti-Cronyism",
      "icon": "TrendingUp",
      "color": "#14B8A6",
      "description": "Breaking up the cozy relationship between government and big business benefits all Americans. Government should not pick winners and losers. These policies find support across the political spectrum and represent realistic starting points.",
      "subPolicies": [
        {
          "title": "Medicare Competitive Bidding",
          "viability": "high",
          "level": "Federal",
          "problem": [
            "Medicare pays fixed prices set by formula, not market competition",
            "Durable medical equipment costs 2-3x retail prices",
            "No incentive for suppliers to compete on price",
            "Taxpayers and beneficiaries pay inflated costs",
            "Prior competitive bidding pilot saved 42% — then was ended due to industry lobbying"
          ],
          "positions": [
            "Expand competitive bidding to all durable medical equipment",
            "Apply competitive bidding principles to other Medicare purchases where feasible",
            "Require transparent pricing data",
            "Allow beneficiaries to shop and keep a portion of savings (reference pricing)"
          ],
          "framing": {
            "forConservatives": "Market competition, not government price-fixing. Let suppliers compete.",
            "forProgressives": "Stop overpaying corporations. Save Medicare money for actual care.",
            "forEveryone": "Why pay $500 for something that costs $100 at the store?"
          },
          "allies": "Taxpayer advocates, fiscal conservatives, some healthcare reformers",
          "opposition": "Medical equipment suppliers, healthcare industry lobbyists"
        },
        {
          "title": "Occupational Licensing Reform",
          "viability": "high",
          "level": "State",
          "problem": [
            "1 in 4 American workers now needs government permission to work (up from 1 in 20 in the 1950s)",
            "Average license requires $267 in fees, 9 months of training, and an exam",
            "Licenses don't transfer between states — blocks military spouses, movers",
            "Primarily protects existing practitioners from competition, not consumers from harm",
            "Barriers hit hardest for low-income workers, immigrants, and those with criminal records"
          ],
          "positions": [
            "Universal recognition: Accept valid out-of-state licenses",
            "Sunset reviews: Require periodic justification for all licensing requirements",
            "Least restrictive means: Use certification, bonding, or inspection instead of licensing where possible",
            "Right to earn a living: Require government to prove licensing is necessary, not the worker to prove they're qualified",
            "Clean slate provisions: Remove licensing barriers for rehabilitated offenders in non-sensitive fields"
          ],
          "framing": {
            "forConservatives": "Free market. Right to earn a living. Get government out of the way.",
            "forProgressives": "Licensing barriers hurt minorities, immigrants, and the poor. This is economic justice.",
            "forEveryone": "You shouldn't need government permission to braid hair or arrange flowers."
          },
          "allies": "Institute for Justice, state policy think tanks, small business groups, workforce development organizations",
          "opposition": "Licensed professionals protecting their markets, some trade associations"
        },
        {
          "title": "Right to Repair",
          "viability": "high",
          "level": "State (primary), Federal (vehicles, medical devices)",
          "problem": [
            "Manufacturers use software locks, proprietary parts, and withheld documentation to block independent repair",
            "John Deere tractors require dealer visits for basic repairs — farmers can't fix their own equipment",
            "Apple and others void warranties for independent repairs and refuse parts to non-authorized shops",
            "Medical devices locked so hospitals can't perform basic maintenance",
            "Electronics designed with planned obsolescence — can't be economically repaired"
          ],
          "positions": [
            "Require manufacturers to provide diagnostic tools, repair documentation, and replacement parts",
            "Prohibit software locks that prevent repair",
            "Prohibit voiding warranties solely because of independent repair",
            "Apply to all product categories: agricultural equipment, electronics, appliances, medical devices, vehicles"
          ],
          "framing": {
            "forConservatives": "Property rights. If you bought it, you own it. You should be able to fix what you own.",
            "forProgressives": "Environmental sustainability. Consumer protection against corporate control.",
            "forFarmers": "Fix your own tractor. Don't wait three weeks for a dealer in planting season."
          },
          "allies": "Farmers' organizations, independent repair shops, consumer advocates, environmental groups, tech repair community",
          "opposition": "Major manufacturers (John Deere, Apple, medical device companies), authorized dealer networks"
        },
        {
          "title": "Civil Asset Forfeiture Reform",
          "viability": "mod-high",
          "level": "State (primary), Federal",
          "problem": [
            "Police can seize property (cash, cars, homes) without ever charging the owner with a crime",
            "Property is 'guilty until proven innocent' — owner must prove it wasn't connected to crime",
            "Law enforcement agencies often keep seized assets, creating profit incentive",
            "Median cash seizure is ~$1,300 — not worth the legal fees to contest",
            "Disproportionately affects low-income and minority communities"
          ],
          "positions": [
            "Require criminal conviction before permanent forfeiture",
            "Shift burden of proof to government",
            "Redirect forfeiture proceeds to general fund (remove profit incentive)",
            "Require clear and convincing evidence standard at minimum",
            "Provide legal representation for those contesting seizures",
            "Mandatory reporting of all seizures"
          ],
          "framing": {
            "forConservatives": "Property rights. Due process. Limited government. This is legalized theft.",
            "forProgressives": "Racial justice. Economic justice. Police accountability.",
            "forEveryone": "Your property shouldn't be guilty until you prove it innocent."
          },
          "allies": "Institute for Justice, ACLU, libertarian organizations, criminal justice reform groups",
          "opposition": "Law enforcement unions, prosecutors' associations, agencies that benefit from forfeiture funds"
        },
        {
          "title": "ESG & Stakeholder Capitalism Opposition",
          "viability": "mod-high",
          "level": "State (pension funds, state contracts), Federal (SEC rules)",
          "problem": [
            "ESG (Environmental, Social, Governance) scores pressure companies to adopt specific political positions",
            "Major asset managers (BlackRock, Vanguard, State Street) vote YOUR shares for ESG goals without your consent",
            "Banks and insurers deny services based on ESG scores (energy companies, gun manufacturers, etc.)",
            "Fiduciary duty to investors replaced with vague 'stakeholder' obligations",
            "State pension funds forced into ESG investments that may underperform"
          ],
          "positions": [
            "Fiduciary duty means financial returns: State pension funds must prioritize returns, not ESG goals",
            "Pass-through voting: Asset managers must vote shares as beneficial owners direct, not as managers prefer",
            "No ESG discrimination: Banks and insurers cannot deny services to legal industries based on ESG scores",
            "Disclosure requirements: Companies must disclose ESG-related costs and impacts on returns",
            "Anti-boycott provisions: State contracts cannot exclude companies for political stances"
          ],
          "framing": {
            "forConservatives": "Fiduciary duty. Shareholder rights. Stop politicizing retirement savings.",
            "forProgressives": "Ask why billionaire asset managers get to vote your shares for their priorities, not yours.",
            "forEveryone": "Your retirement savings should be managed for returns, not political agendas."
          },
          "allies": "State financial officers, energy sector, Second Amendment groups, free market think tanks",
          "opposition": "Major asset managers, ESG rating agencies, progressive advocacy groups"
        },
        {
          "title": "Healthcare Price Transparency",
          "viability": "high",
          "level": "Federal (Medicare/Medicaid), State (commercial)",
          "problem": [
            "Patients cannot get prices before receiving care",
            "Same procedure varies 10x between facilities in same city",
            "Insurance 'negotiated rates' are secret — you can't shop",
            "Surprise bills from out-of-network providers",
            "Hospital chargemasters are fiction — no one pays those rates",
            "Existing federal transparency rules (2021) widely ignored, poorly enforced"
          ],
          "positions": [
            "Enforce existing hospital price transparency rules with real penalties",
            "Require binding upfront estimates for non-emergency care",
            "All-payer claims databases at state level (every insurance payment public)",
            "Real-time eligibility and price lookup tools",
            "Ban gag clauses that prevent price disclosure",
            "Reference pricing: Medicare pays market rate, not inflated hospital rate"
          ],
          "framing": {
            "forConservatives": "Free markets require price information. You can't have competition without prices.",
            "forProgressives": "Patients deserve to know what they'll pay. End surprise bills.",
            "forEveryone": "You wouldn't buy a car without knowing the price. Why accept that for surgery?"
          },
          "allies": "Patient advocates, employers, some insurers, fiscal conservatives",
          "opposition": "Hospital systems, some provider groups that benefit from price opacity"
        },
        {
          "title": "Environmental Policy: Outcome-Based, State-Driven",
          "viability": "moderate",
          "level": "Federal (framework), State (implementation)",
          "problem": [
            "Environmental regulations increasingly driven by political agenda rather than measurable outcomes",
            "One-size-fits-all federal mandates ignore regional differences",
            "Permitting delays block infrastructure for years (average NEPA review: 4.5 years)",
            "Regulations used as weapon against disfavored industries regardless of actual environmental impact",
            "Compliance costs fall hardest on small businesses and rural communities"
          ],
          "positions": [
            "Outcome-based standards: Set measurable environmental goals (air quality, water quality, species population), let states determine how to achieve them",
            "Streamline permitting: Categorical exclusions for proven low-impact activities; concurrent (not sequential) reviews",
            "Cost-benefit requirements: Rigorous analysis of costs vs. environmental benefits for all major rules",
            "State primacy: States with proven track records should have primary implementation authority",
            "Sunset provisions: Regulations expire unless renewed with demonstrated effectiveness"
          ],
          "framing": {
            "forConservatives": "Federalism. States know their environments better than Washington. Focus on results, not process.",
            "forProgressives": "Outcome-based standards can achieve better environmental results faster than bureaucratic process.",
            "forEveryone": "Clean air and water matter. Decade-long permitting delays don't help the environment."
          },
          "allies": "State environmental agencies, business groups, some conservation organizations focused on outcomes",
          "opposition": "National environmental groups invested in federal control, regulatory agencies protecting jurisdiction"
        }
      ]
    },
    {
      "id": "food-health-sovereignty",
      "slug": "food-health-sovereignty",
      "title": "Food & Health Sovereignty",
      "icon": "Heart",
      "color": "#10B981",
      "description": "Americans should have the freedom to make their own food and health choices, access products from local producers, and be protected from harmful substances that other developed nations have banned. Food freedom and medical freedom are fundamental rights.",
      "subPolicies": [
        {
          "title": "Unpasteurized (Raw) Dairy Legalization",
          "viability": "mod-high",
          "level": "State (primary), Federal (long-term)",
          "problem": [
            "Federal law prohibits interstate sale of raw milk",
            "Many states ban or heavily restrict intrastate sales",
            "Small dairy farmers cannot sell directly to willing consumers",
            "Raw dairy consumed for millennia; many countries allow regulated sale",
            "Enforcement includes armed raids on small farms"
          ],
          "positions": [
            "Legalize on-farm sales (consumer can inspect conditions)",
            "Legalize retail sales with appropriate labeling and consumer acknowledgment",
            "Allow herd-share arrangements (consumer owns portion of animal)",
            "Reasonable food safety testing without prohibitive costs",
            "Repeal federal ban on interstate raw milk sales",
            "Allow states to determine their own raw dairy policies",
            "End FDA enforcement actions against small producers selling to informed consumers"
          ],
          "framing": {
            "forEveryone": "Adults should be free to buy raw milk if they understand the risks. This is about freedom and informed choice."
          },
          "currentStatus": "Legal for retail sale: ~13 states | On-farm sales only: ~17 states | Herd-shares only: ~10 states | Illegal: ~10 states",
          "allies": "Farm-to-Consumer Legal Defense Fund, Weston A. Price Foundation, libertarian groups",
          "opposition": "Industrial dairy, some public health officials"
        },
        {
          "title": "Local Food & Cottage Food Reform",
          "viability": "high",
          "level": "State (primary), some federal action",
          "problem": [
            "Cottage food laws (home-based food businesses) vary widely and are often restrictive",
            "Small farmers face same regulatory burden as large operations",
            "Direct-to-consumer sales restricted by rules designed for wholesale distribution",
            "On-farm processing facilities subject to industrial-scale requirements",
            "Small meat processors nearly eliminated by USDA inspection requirements"
          ],
          "positions": [
            "Expand list of allowed cottage food products",
            "Increase or eliminate sales caps",
            "Allow online and delivery sales, not just farmers markets",
            "Clear labeling requirements instead of outright bans",
            "Exempt direct farm-to-consumer sales from regulations designed for wholesale",
            "Allow on-farm poultry processing up to reasonable limits (1,000-20,000 birds/year)",
            "Support custom-exempt meat processing for farm-direct sales",
            "Producer-only farmers markets with streamlined requirements",
            "Support for small-scale USDA-inspected processing facilities",
            "Mobile slaughter units for rural areas",
            "Shared-use commercial kitchens for cottage food producers"
          ],
          "framing": {
            "forEveryone": "A grandmother shouldn't need a $50,000 commercial kitchen to sell cookies. Let people cook."
          },
          "modelLegislation": "Wyoming, Maine, and Utah have passed Food Freedom Acts that allow direct producer-to-consumer sales with informed consent, exempt from licensing and inspection requirements.",
          "allies": "Farm bureaus, local food movements, homesteading communities",
          "opposition": "Industrial food processors, some health departments"
        },
        {
          "title": "Removing Toxic Chemicals from Food Supply",
          "viability": "moderate",
          "level": "Federal (FDA regulatory action or congressional legislation)",
          "problem": [
            "Red Dye No. 3 — banned in cosmetics since 1990 but still in food; linked to cancer",
            "Red Dye No. 40 — linked to hyperactivity; requires warning labels in EU",
            "Yellow No. 5 & 6 — require warnings in EU; linked to behavioral issues",
            "Brominated vegetable oil (BVO) — banned in EU and Japan; neurological concerns",
            "Potassium bromate — banned in EU, UK, Canada, Brazil; classified as possible carcinogen",
            "Azodicarbonamide — banned in EU and Australia; used in US bread products",
            "BHA/BHT preservatives — restricted in many countries; potential carcinogens",
            "rBGH/rBST (bovine growth hormone) — banned in EU, Canada, Australia; linked to health concerns"
          ],
          "positions": [
            "Immediate ban on Red Dye No. 3 (already banned in cosmetics — extend to food)",
            "Immediate ban on Brominated vegetable oil",
            "Immediate ban on Potassium bromate",
            "EU-style warning labels for artificial dyes linked to behavioral issues",
            "Clear disclosure of all artificial additives",
            "Country of origin labeling expansion",
            "Review all GRAS (Generally Recognized as Safe) substances grandfathered from old regulations",
            "End industry self-certification for new food additives",
            "Adopt precautionary principle — burden of proof on manufacturer",
            "Harmonize with EU/international standards where appropriate"
          ],
          "framing": {
            "forParents": "Protect children from additives linked to behavioral and health problems.",
            "forConsumers": "Americans deserve the same protections as Europeans.",
            "forConservatives": "Informed consent — let people know what's in their food."
          },
          "allies": "Consumer advocacy groups, parents' organizations, reformulating food companies",
          "opposition": "Food industry associations, chemical manufacturers"
        },
        {
          "title": "Medical Freedom & Informed Consent",
          "viability": "mod-high",
          "level": "Primarily state, some federal",
          "problem": [
            "Medical mandates override individual autonomy",
            "Vaccine requirements for employment and education expanding",
            "Limited informed consent in emergency situations",
            "Alternative treatments suppressed or banned",
            "One-size-fits-all mandates ignore individual health conditions"
          ],
          "positions": [
            "Individuals have the right to make their own medical decisions",
            "Informed consent requires full disclosure of risks, benefits, and alternatives",
            "Government mandates should be limited and subject to robust exemption rights",
            "Medical decisions should remain between patient and provider",
            "Access to treatments should not be contingent on accepting other treatments",
            "Require meaningful informed consent for all medical interventions",
            "Protect religious, philosophical, and medical exemptions to mandates",
            "Prohibit termination based solely on medical treatment decisions",
            "No medical requirements for public education beyond genuine public health necessities",
            "Protect healthcare providers who conscientiously object to procedures",
            "Right to try experimental treatments with informed consent",
            "Strengthen medical privacy protections; limit employer/government access to records"
          ],
          "framing": {
            "forEveryone": "Your body, your choice. Medical freedom is fundamental—not negotiable."
          },
          "allies": "Medical freedom organizations, religious groups, civil liberties advocates",
          "opposition": "Public health establishment, some medical associations"
        }
      ]
    },
    {
      "id": "property-rights",
      "slug": "property-rights",
      "title": "Property Rights",
      "icon": "Home",
      "color": "#F59E0B",
      "description": "Property rights are foundational to liberty. Government and private entities increasingly infringe on what Americans can do with their own property. When you buy something, you should own it — fully.",
      "subPolicies": [
        {
          "title": "Homeowners Association Reform",
          "viability": "high",
          "level": "State (HOA law is state-specific)",
          "problem": [
            "Mandatory membership with no opt-out option for existing communities",
            "Broad, vague restrictions enforced arbitrarily",
            "Fines and penalties with limited due process",
            "Foreclosure authority for unpaid assessments (including minor amounts)",
            "Selective enforcement based on board member relationships",
            "Limited transparency in financial management",
            "Elections subject to manipulation by management companies",
            "Restrictions that conflict with state/federal law (solar panels, flags, etc.)"
          ],
          "positions": [
            "Require open meetings and access to financial records",
            "Mandate competitive bidding for contracts",
            "Prohibit board members from self-dealing",
            "Require independent audits for HOAs above certain size",
            "Term limits for board members",
            "Cap fines; require escalating warnings before penalties",
            "Prohibit foreclosure for fines (assessments only, with limits)",
            "Require due process before any penalty (notice, hearing, appeal)",
            "Statute of limitations on violations",
            "Selective enforcement as affirmative defense",
            "Protect solar panels and energy equipment",
            "Protect flag display (US flag already protected; extend to state/military)",
            "Allow political signs (time-limited during elections)",
            "Allow vegetable gardens (reasonable backyard use)",
            "Strengthen disability accommodations enforcement",
            "Protect reasonable religious expression",
            "Mandatory disclosure to buyers before purchase",
            "CC&R plain language requirements",
            "Online access to all governing documents"
          ],
          "framing": {
            "forConservatives": "Property rights — you bought it, you should be able to use it.",
            "forHomeowners": "Protection from petty tyranny and arbitrary enforcement.",
            "forEveryone": "HOAs exercise government-like power without government-like accountability."
          },
          "allies": "Property rights groups, homeowner advocates, real estate consumer groups",
          "opposition": "HOA management companies, some HOA boards"
        },
        {
          "title": "Eminent Domain Reform",
          "viability": "mod-high",
          "level": "State (many reformed after Kelo; some need strengthening)",
          "problem": [
            "Since Kelo v. City of New London (2005), 'public use' stretched to allow takings for private development",
            "Property can be taken and given to private developers if it might increase tax revenue",
            "Low-income neighborhoods targeted for 'redevelopment'",
            "Compensation often inadequate (fair market value may not cover relocation costs)",
            "Threat of eminent domain used to coerce below-market sales"
          ],
          "positions": [
            "Public Use Restriction: Limit eminent domain to true public use (roads, utilities, public buildings)",
            "No Private-to-Private Transfers: Prohibit taking property to give to another private party",
            "Just Compensation Plus: Compensation must include relocation costs, not just market value",
            "Blight Definition: Tighten definition of 'blight' to prevent abuse",
            "Right of First Refusal: If taken property not used for stated purpose, original owner can repurchase"
          ],
          "framing": {
            "forEveryone": "Your home isn't a revenue opportunity for developers. Eminent domain should be rare and compensated fairly."
          },
          "allies": "Property rights groups, Castle Coalition, affected communities",
          "opposition": "Developers, municipal governments, economic development agencies"
        },
        {
          "title": "Mineral Rights Protection",
          "viability": "mod-high",
          "level": "State (property law is state-specific)",
          "problem": [
            "Mineral rights severed from surface rights on vast majority of American land",
            "Most property buyers have no opportunity to purchase mineral rights — already owned by corporations",
            "Corporations sit on mineral rights indefinitely without productive use — 'mineral right squatting'",
            "Similar market failure to patent trolls and domain name squatters",
            "Landowners have limited rights when mineral owners access their property",
            "Foreign corporations increasingly own American mineral rights",
            "Concentrated ownership enables market manipulation and speculation"
          ],
          "positions": [
            "Active Development Requirement: Mineral rights must show active exploration, development, or production within defined period (e.g., 10 years)",
            "Holding Fees: Escalating annual fees for undeveloped mineral rights — discourages pure speculation",
            "Reversion to Surface Owner: Abandoned or long-inactive mineral rights revert to surface property owner",
            "Bona Fide Development Standard: Token drilling/exploration doesn't satisfy requirement — must be genuine commercial activity",
            "Exemption for Active Leases: Rights under active lease with producing operator are protected",
            "Access Compensation: Fair compensation for surface disruption, not just mineral value",
            "Restoration Bonds: Mineral operators must post bonds for full site restoration",
            "Notice Requirements: Advance notice and negotiation before surface access",
            "Damage Liability: Strict liability for surface damage, groundwater contamination",
            "Right of First Refusal: Surface owners have first right to purchase mineral rights when sold",
            "Reunification Incentives: Tax incentives for reunifying mineral and surface rights",
            "Disclosure Requirements: Clear disclosure of severed mineral rights in all property transactions",
            "Anti-Concentration Limits: Prevent single entities from controlling dominant share of regional mineral rights",
            "Foreign Ownership Restrictions: Limit or prohibit foreign ownership of mineral rights (national security)",
            "Transparency Registry: Public registry of all mineral rights ownership",
            "Shell Company Disclosure: Require disclosure of beneficial owners behind corporate mineral owners"
          ],
          "framing": {
            "forConservatives": "Property rights — if you own the land, you should have opportunity to own what's under it. End corporate squatting.",
            "forProgressives": "Environmental protection through landowner empowerment. End extractive industry exploitation.",
            "forRuralCommunities": "Give families control over their land. Stop absentee corporations from dictating land use.",
            "forEnergyIndependence": "Active development requirements increase domestic production; speculation decreases it."
          },
          "note": "This policy must carefully balance protecting current property rights (mineral owners have legitimate ownership) with preventing market failures. Focus on use requirements and access reforms rather than confiscation. Model on successful 'use it or lose it' precedents in water rights, spectrum allocation, and mining claims.",
          "allies": "Farm bureaus, rural landowners, environmental groups, energy independence advocates",
          "opposition": "Oil/gas companies, mineral speculators, some property rights absolutists"
        }
      ]
    },
    {
      "id": "government-accountability",
      "slug": "government-accountability",
      "title": "Government Accountability & Reform",
      "icon": "Scale",
      "color": "#3B82F6",
      "description": "Americans have lost trust in government institutions. Restoring accountability requires structural reforms that limit conflicts of interest, increase transparency, and return power to citizens. Those who govern should be accountable to those they govern.",
      "subPolicies": [
        {
          "title": "Congressional Stock Trading Ban",
          "viability": "high",
          "level": "Federal",
          "problem": [
            "Members of Congress trade stocks while having access to non-public information",
            "Exposed trades during COVID-19 pandemic (insider information on economic impact)",
            "Committee members trading stocks of companies they regulate",
            "Defense committee members investing in defense contractors",
            "STOCK Act (2012) has proven inadequate — weak enforcement, minor penalties"
          ],
          "positions": [
            "Full Trading Ban: Prohibit members and senior staff from trading individual stocks",
            "Blind Trusts or Index Funds Only: Investments limited to diversified holdings without individual stock selection",
            "Family Coverage: Extend restrictions to spouse and dependent children",
            "Meaningful Penalties: Substantial fines (percentage of trade value), referral for prosecution",
            "Disclosure Enhancement: Real-time disclosure of all trades (current law allows 45 days)",
            "Independent Enforcement: Remove enforcement from congressional self-policing"
          ],
          "framing": {
            "forEveryone": "If you serve in Congress, you shouldn't get rich trading on inside information. Ban it completely."
          },
          "momentum": "Bipartisan support exists — bills introduced by both parties. Multiple competing proposals (strongest: full ban; weakest: enhanced disclosure). Public support exceeds 70% across party lines. Several members have voluntarily divested.",
          "allies": "Good government groups, both progressive and conservative reformers",
          "opposition": "Many current members benefit from status quo"
        },
        {
          "title": "Term Limits",
          "viability": "varies",
          "level": "Federal (constitutional amendment), State (statutory)",
          "problem": [
            "Career politicians become detached from constituents and beholden to permanent Washington",
            "Average House tenure has increased dramatically over past century",
            "Incumbent re-election rates exceed 90%",
            "Seniority system concentrates power among longest-serving members",
            "Permanent political class with different interests than constituents"
          ],
          "positions": [
            "House of Representatives: 6 terms (12 years)",
            "Senate: 2 terms (12 years)",
            "Combined congressional service: 12-18 years total",
            "Governor: 2 terms (already exists in most states)",
            "State legislators: 8-12 years",
            "Implementation via constitutional amendment (traditional path — requires 2/3 Congress + 3/4 states)",
            "Article V Convention of States (34 states call convention; 38 ratify)",
            "State-level first: term limits for state legislators build momentum"
          ],
          "framing": {
            "forEveryone": "Public service shouldn't be a lifetime career. Term limits would break the stranglehold of career politicians."
          },
          "viabilityNote": "Federal: LOW (requires constitutional amendment) | State: HIGH (15 states have legislative term limits)",
          "allies": "U.S. Term Limits, Convention of States, grassroots movements",
          "opposition": "Incumbent politicians, congressional leadership"
        },
        {
          "title": "End Lobbying: The Citizen Voice Portal",
          "viability": "low-mod",
          "level": "Federal (constitutional amendment may be required for full implementation)",
          "problem": [
            "Billions spent annually by corporations and special interests to influence legislation",
            "Politicians claim they need lobbyists to understand issues — this is a solvable information problem",
            "Rich entities hidden behind layers of PACs and organizations buy laws that hurt ordinary citizens",
            "Technical expertise can come from public experts, academics, GAO — not paid advocates",
            "Reform attempts get worked around; the only solution is replacement",
            "Every citizen should have equal voice — not voice proportional to wealth"
          ],
          "positions": [
            "Equal Voice: Every citizen gets 100 points annually — billionaire and minimum wage worker identical",
            "Policy Positions: Allocate points to specific policy positions you support",
            "Flexible Allocation: Put all 100 on one issue you care deeply about, or spread across many",
            "Annual Cycle: Fresh allocation each year; priorities can shift",
            "Three-Round Refinement: Citizens submit positions, top tier advances through rounds, final ranking determined",
            "Top 3 Positions BINDING: Congress MUST introduce legislation and hold floor vote",
            "Ban Paid Lobbying: No more professional lobbyists paid to influence legislation",
            "Citizens Can Still Petition: First Amendment right preserved — individuals can contact representatives",
            "Expert Testimony Preserved: Public expert panels, academic testimony, GAO analysis — not paid advocates",
            "Revolving Door Closed: Lifetime ban on former officials becoming lobbyists",
            "One Citizen One Voice: Tied to government credentials, encrypted and anonymized",
            "Open Source Code: Everyone can see exactly how it works; no black boxes"
          ],
          "framing": {
            "forPopulistRight": "End the swamp. No more corporations buying laws. Your voice equals George Soros's voice.",
            "forPopulistLeft": "End corporate capture. No more billionaires writing legislation. Democracy for actual people.",
            "forEveryone": "Why should a hedge fund have more influence over YOUR government than you do? One citizen, one voice."
          },
          "implementationChallenges": "Constitutional questions on banning paid lobbying; $4+ billion lobbying industry will fight; many politicians benefit from status quo; digital divide requires non-digital access options",
          "allies": "Populists left and right, anti-corruption advocates, democracy reform movements, ordinary citizens",
          "opposition": "Lobbying industry, corporations with legislative agendas, politicians benefiting from status quo"
        },
        {
          "title": "Regulatory State Reform",
          "viability": "moderate",
          "level": "Federal",
          "problem": [
            "Unelected bureaucracies make rules with the force of law, violating separation of powers",
            "Agencies issue thousands of rules annually; Congress passes hundreds of laws",
            "Chevron deference allows agencies to interpret their own authority broadly",
            "Cost of federal regulations estimated at $2+ trillion annually",
            "Administrative law judges within agencies judge their own cases"
          ],
          "positions": [
            "REINS Act: Major rules (>$100M impact) require congressional approval",
            "End Chevron Deference: Courts should not defer to agency interpretation of ambiguous statutes",
            "Regulatory Budget: Cap total regulatory costs; new rules require offsetting eliminations",
            "Sunset Provisions: Regulations automatically expire unless reauthorized",
            "Independent ALJs: Remove administrative law judges from agency control",
            "Cost-Benefit Requirements: Rigorous, independent cost-benefit analysis for all rules"
          ],
          "framing": {
            "forEveryone": "Agencies should execute the law—not write it. Congress must reclaim its authority."
          },
          "allies": "Business groups, libertarian organizations, constitutional scholars",
          "opposition": "Agencies, regulatory beneficiaries, administrative law establishment"
        },
        {
          "title": "Legislative Reform: Transparency, Sunset & Accountability",
          "viability": "mod-high",
          "level": "State first, then federal",
          "problem": [
            "Thousand-page bills passed with hours or minutes to review",
            "Unrelated provisions attached to must-pass legislation",
            "Laws remain on books indefinitely — never reviewed for effectiveness",
            "Complex issues used to justify omnibus bills that escape scrutiny",
            "Members vote on bills they haven't read",
            "Lobbyists insert provisions that would fail as standalone bills"
          ],
          "positions": [
            "Single Subject Rule: Each bill addresses one subject (many state constitutions have this)",
            "Title-Content Consistency: Bill contents must match the title/stated purpose",
            "Minimum Review Period: No vote until bill text available for 72 hours minimum",
            "Read the Bills Act: Require attestation that member (or senior staff) has read the bill",
            "Separate Votes: Amendments voted separately from underlying bill",
            "Plain Language Summaries: Non-lawyer readable summary required for every bill",
            "Default Expiration: All non-constitutional laws expire automatically after set period",
            "Tiered Renewal: Routine laws 5 years, major policy 10 years, foundational 20 years",
            "Effectiveness Review: Before renewal, require assessment of whether law achieved purpose",
            "Complex Issue Handling: Reform packages broken into separate single-subject bills with sequenced voting",
            "Phase Gates: Complex reforms implemented in phases with review gates and abort mechanisms"
          ],
          "framing": {
            "forConservatives": "Government must continuously justify its power. Bad laws die automatically.",
            "forProgressives": "Regular review ensures laws adapt to changing conditions and actually work.",
            "forEveryone": "No more thousand-page bills no one reads. Complexity handled transparently, not hidden."
          },
          "allies": "Good government groups, transparency advocates, libertarians, fiscal conservatives",
          "opposition": "Legislative leadership (both parties), lobbyists who benefit from complexity"
        },
        {
          "title": "Emergency Powers Reform",
          "viability": "high",
          "level": "State (emergency powers are state-specific)",
          "problem": [
            "COVID-19 revealed governors wielding near-unlimited emergency powers for years",
            "Emergency declarations extended indefinitely without legislative review",
            "Businesses destroyed by executive order without due process or compensation",
            "Churches closed while liquor stores stayed open — arbitrary enforcement",
            "Constitutional rights suspended by executive fiat",
            "No mechanism for citizens to challenge emergency measures in real-time",
            "Emergency powers designed for hurricanes used for indefinite social control"
          ],
          "positions": [
            "Automatic Expiration: Emergency declarations expire after 30-60 days without legislative renewal",
            "Legislative Approval Required: Any extension beyond initial period requires affirmative legislative vote",
            "No Successive Declarations: Cannot declare new emergency for same event to circumvent time limits",
            "Termination Authority: Legislature can terminate emergency by majority vote at any time",
            "Enumerated Powers: Define specific powers available during emergency — no open-ended authority",
            "Constitutional Carve-Outs: Certain rights cannot be suspended even during emergency (worship, assembly, speech)",
            "Business Closure Standards: Clear criteria for which businesses can be closed and under what conditions",
            "Geographic Limits: Emergency powers limited to affected areas, not statewide when localized",
            "Compensation for Closures: Businesses closed by government order entitled to compensation",
            "Expedited Judicial Review: Fast-track court review of emergency measures",
            "Personal Liability: Officials who exceed emergency authority face personal liability"
          ],
          "framing": {
            "forConservatives": "Separation of powers. Executive cannot rule by decree indefinitely.",
            "forProgressives": "Protect civil liberties. Prevent future administrations from abusing emergency powers.",
            "forBusinessOwners": "Never again will your livelihood be destroyed by indefinite executive order.",
            "forEveryone": "Emergencies don't suspend the Constitution. Temporary means temporary."
          },
          "provenSuccess": "Post-COVID, numerous states have passed emergency powers reform: Ohio, Kansas, Pennsylvania, Kentucky, and others. This is a winning issue with demonstrated bipartisan support.",
          "allies": "Libertarians, civil liberties groups, business associations, constitutional scholars",
          "opposition": "Governors (both parties), public health establishment"
        }
      ]
    },
    {
      "id": "election-integrity",
      "slug": "election-integrity",
      "title": "Election Integrity",
      "icon": "Vote",
      "color": "#8B5CF6",
      "description": "Free and fair elections are essential to self-governance. Reforms should make it easy to vote and hard to cheat, while restoring public confidence in electoral outcomes. Every legal vote should count; no illegal vote should count.",
      "subPolicies": [
        {
          "title": "Voter Identification",
          "viability": "high",
          "level": "State",
          "problem": [
            "Many states allow voting without verifying identity",
            "Inconsistent standards create confusion across jurisdictions",
            "Lack of verification undermines confidence in results",
            "Absentee ballot verification often weaker than in-person"
          ],
          "positions": [
            "Require government-issued photo ID to vote in person",
            "Free ID available to any citizen who lacks one",
            "Provisional ballot available for those without ID (with verification process)",
            "ID requirement for requesting and returning absentee ballots",
            "Accept multiple forms (driver's license, passport, military ID, state ID)",
            "Reasonable accommodations for elderly and disabled"
          ],
          "framing": {
            "forEveryone": "You need an ID to buy beer—why not to vote? Free ID plus voter ID requirement is common sense."
          },
          "currentStatus": "Majority of states have some form of voter ID; broad public support across party lines",
          "allies": "Election integrity advocates, most state legislators",
          "opposition": "Some voting rights groups concerned about access barriers"
        },
        {
          "title": "Paper Ballots",
          "viability": "high",
          "level": "State",
          "problem": [
            "Electronic-only voting machines have no audit trail",
            "Voting systems vulnerable to hacking and malfunction",
            "Internet-connected systems create security vulnerabilities",
            "Difficult to verify accuracy or conduct meaningful recounts without paper"
          ],
          "positions": [
            "Hand-marked paper ballots as primary voting method",
            "Where machines are used, voter-verified paper audit trail required",
            "Paper ballots preserved for recount and audit purposes",
            "No internet-connected voting systems",
            "Voter verifies paper ballot before casting",
            "Paper is the official record for recounts"
          ],
          "framing": {
            "forEveryone": "Paper ballots are simple, transparent, and trustworthy. High-tech isn't always better."
          },
          "currentStatus": "Most states already use paper ballots; consensus building across political spectrum",
          "allies": "Election security experts, both parties increasingly",
          "opposition": "Some election equipment vendors"
        },
        {
          "title": "Chain of Custody & Security",
          "viability": "mod-high",
          "level": "State",
          "problem": [
            "Ballots transported without clear tracking documentation",
            "Unsecured or unmonitored drop boxes in some jurisdictions",
            "Gaps in custody records make irregularities difficult to trace",
            "Insufficient observer access at critical stages"
          ],
          "positions": [
            "Documented chain of custody for all ballots from printing to counting",
            "Bipartisan observer access at all stages of election process",
            "Video surveillance of ballot storage and counting areas",
            "Secure ballot transport with multiple witnesses",
            "Secured, monitored drop boxes (if used at all)",
            "Real-time tracking and documentation systems",
            "Criminal penalties for chain-of-custody violations"
          ],
          "framing": {
            "forEveryone": "We track Amazon packages—why not ballots? Tight security builds trust."
          },
          "allies": "Election integrity advocates, law enforcement",
          "opposition": "Some election administrators concerned about implementation costs"
        },
        {
          "title": "Timely Results & Audits",
          "viability": "moderate",
          "level": "State",
          "problem": [
            "Days or weeks to count votes in some jurisdictions",
            "Delayed results erode public confidence",
            "Inconsistent and rare audits across states",
            "Some states prohibit early processing of mail ballots"
          ],
          "positions": [
            "Count all ballots election night to extent possible",
            "Early processing of mail ballots (where permitted) to enable timely counting",
            "Mandatory post-election audits (risk-limiting audits preferred)",
            "Random precinct hand-count verification",
            "Full audit if margin within specified threshold",
            "Results announced same night or within 24 hours",
            "Public observation of counting process"
          ],
          "framing": {
            "forEveryone": "France counts 40 million votes in 24 hours. America can do better."
          },
          "viabilityNote": "Requires process changes; some state resistance to changing mail ballot processing rules",
          "allies": "Election reformers, transparency advocates",
          "opposition": "Some election administrators, states with extensive mail voting"
        },
        {
          "title": "Voter Roll Maintenance & Mail Voting",
          "viability": "moderate",
          "level": "State",
          "problem": [
            "Voter rolls include deceased voters, moved voters, and duplicates",
            "States don't adequately share data for cross-state verification",
            "Outdated rolls can enable errors or fraud",
            "Unsolicited mail ballots sent to outdated addresses",
            "Inconsistent signature verification standards"
          ],
          "positions": [
            "Regular list maintenance to remove deceased, moved, and ineligible voters",
            "Participation in interstate cross-check systems (ERIC or alternatives)",
            "Verification of citizenship for voter registration",
            "Voter request required for mail ballots (no unsolicited mailing to all addresses)",
            "Signature verification with cure process for mismatches",
            "Ballot received by election day (postmark not sufficient)",
            "Limits on ballot harvesting (third-party collection)",
            "Easy re-registration if removed in error"
          ],
          "framing": {
            "forEveryone": "Clean voter rolls protect everyone's vote. Regular maintenance is basic election hygiene."
          },
          "viabilityNote": "Politically contentious; legal challenges common; mail voting restrictions highly dependent on state political environment",
          "allies": "Election integrity groups, some state legislators",
          "opposition": "Voting rights groups, states with universal mail voting"
        }
      ]
    },
    {
      "id": "constitutional-rights",
      "slug": "constitutional-rights",
      "title": "Constitutional Rights",
      "icon": "Shield",
      "color": "#EF4444",
      "description": "The Bill of Rights protects fundamental liberties from government infringement. These rights face ongoing threats and require active defense. The Constitution means what it says.",
      "subPolicies": [
        {
          "title": "Free Speech Protection",
          "viability": "mod-high",
          "level": "State (campus speech, anti-SLAPP) + Federal (jawboning, financial)",
          "problem": [
            "Government pressure on platforms to censor (jawboning)",
            "Campus speech codes and 'free speech zones'",
            "Employment consequences for political speech",
            "Strategic lawsuits to silence critics (SLAPPs)",
            "Financial deplatforming for legal speech",
            "Government-funded 'disinformation' monitoring"
          ],
          "positions": [
            "Anti-Jawboning: Prohibit government officials from pressuring platforms to censor legal speech",
            "Campus Free Speech: Protect free expression at public universities; no 'free speech zones'",
            "Anti-SLAPP Laws: Strengthen protections against lawsuits designed to silence speech",
            "Viewpoint Neutrality: Government programs cannot discriminate based on viewpoint",
            "Financial Access: Banks and payment processors cannot discriminate against legal speech/activities",
            "Transparency: Require disclosure of government-platform communications about content moderation"
          ],
          "framing": {
            "forEveryone": "Free speech is the foundation of all other rights. Protect it everywhere."
          },
          "allies": "Civil liberties organizations, academic freedom advocates",
          "opposition": "Platform companies, some advocacy groups"
        },
        {
          "title": "Individual Liberty & Freedom of Conscience",
          "viability": "mod-high",
          "level": "State (most applications) + Federal (constitutional framework)",
          "corePrinciple": "Every individual has the right to live according to their own beliefs, identity, and choices — and every individual has the right NOT to be compelled to affirm, participate in, or express beliefs they do not hold. Your freedom to be yourself does not create an obligation for others to validate you.",
          "problem": [
            "Government and private entities compelling speech and affirmation",
            "Religious and conscience objections overridden",
            "Activists on both sides seeking to use government to impose their views",
            "Lack of consistent application of liberty principles"
          ],
          "positions": [
            "Marriage: Right to marry any consenting adult; government recognition of all marriages",
            "Identity: Right to identify, present, and live as you choose",
            "Belief: Right to hold any religious, philosophical, or personal beliefs",
            "No Compelled Speech: Cannot be forced to use specific words, pronouns, or affirmations",
            "No Compelled Participation: Cannot be forced to participate in ceremonies or events that violate conscience",
            "Religious Exercise: Religious individuals and organizations can operate according to their beliefs",
            "Creative Expression: Artists, writers, and creators cannot be compelled to create content that violates their beliefs",
            "Professional Conscience: Professionals can decline services that violate deeply held beliefs (with referral obligation)",
            "Marriage Equality + Religious Liberty: Government recognizes all marriages; religious institutions choose which to solemnize",
            "Public Accommodations: General services available to all; custom expressive services protected"
          ],
          "framing": {
            "forConservatives": "Your religious beliefs and conscience are protected. No one can force you to affirm what you don't believe.",
            "forProgressives": "LGBTQ+ individuals have full legal equality and protection from government discrimination.",
            "forLibertarians": "Maximum liberty for everyone. Your rights end where compulsion of others begins.",
            "forEveryone": "We don't have to agree on everything to live peacefully together. Tolerance means tolerating difference, not demanding uniformity."
          },
          "allies": "Classical liberals, libertarians, religious liberty advocates, civil liberties groups (selectively)",
          "opposition": "Activists on both extremes who want to use government to impose their views"
        },
        {
          "title": "Reproductive Rights: First Trimester Access + Adoption Investment",
          "viability": "moderate",
          "level": "Federal framework + State implementation",
          "compromiseNote": "This position will not satisfy pro-life absolutists who believe life begins at conception, nor pro-choice absolutists who believe abortion should be unrestricted until birth. It attempts to find the position that most Americans actually hold — legal access early in pregnancy, restrictions later, with real investment in alternatives.",
          "problem": [
            "Post-Dobbs patchwork of state laws creates confusion",
            "Neither extreme position matches majority public opinion",
            "Restrictions without alternatives force impossible choices",
            "Current adoption system inadequate to provide real alternatives"
          ],
          "positions": [
            "First Trimester Legal: Abortion legal and accessible through end of first trimester (12 weeks)",
            "After First Trimester: Abortion illegal except for defined exceptions",
            "Exceptions: Life of Mother, Severe Fetal Abnormality, Rape (with documentation), Incest (with documentation), Very Young Girls (under 15)",
            "Both Parties Accountable: Both the person seeking and the provider performing illegal abortion face penalties",
            "Mandatory Adoption Infrastructure: Federal mandate requiring states to provide robust adoption pathways",
            "No-Questions Safe Surrender: Safe haven laws in all states — surrender newborn without prosecution",
            "Guaranteed Placement: Every child surrendered guaranteed pathway to adoption",
            "Streamlined Adoption: Reduce bureaucratic barriers; expedite process",
            "Adoption Support: Financial support for adoptive families; remove cost as barrier",
            "Birth Mother Support: Medical care, counseling, and support for women choosing adoption"
          ],
          "framing": {
            "forProLife": "Meaningful restriction after first trimester. Both parties face real consequences. Investment in adoption makes 'choose life' viable.",
            "forProChoice": "Preserves access during the period when 93% of abortions occur. Exceptions for hard cases. No forced birth without real alternatives.",
            "forModerates": "This is what most Americans actually believe — and what most of Europe does. Legal early, restricted later, with support for alternatives.",
            "forEveryone": "Reduces abortions through support, not just restriction. Takes 'what happens after' seriously."
          },
          "allies": "Moderates, adoption advocates, those exhausted by culture war absolutism",
          "opposition": "Pro-life absolutists, pro-choice absolutists, single-issue voters on both sides"
        },
        {
          "title": "Second Amendment",
          "viability": "varies",
          "level": "State (most policy) + Federal (reciprocity, industry protection)",
          "problem": [
            "Incremental restrictions on gun ownership",
            "Red flag laws often lack due process",
            "Arbitrary 'assault weapon' definitions and bans",
            "Restrictions target law-abiding citizens, not criminals"
          ],
          "positions": [
            "Right to keep and bear arms is an individual right",
            "Second Amendment applies to modern firearms",
            "Self-defense is a fundamental right",
            "Shall-issue (or constitutional carry) for concealed carry permits",
            "National reciprocity for carry permits",
            "Opposition to assault weapons bans, magazine restrictions, registration schemes",
            "Constitutional Carry: No permit required for law-abiding citizens to carry",
            "Preemption: State law preempts local gun regulations",
            "Range Protection: Protect shooting ranges from nuisance lawsuits",
            "School Protection: Allow trained staff to carry; enhance school security",
            "Due Process: Red flag laws (if they exist) must include robust due process protections",
            "Industry Protection: Prohibit lawsuits against manufacturers for criminal misuse"
          ],
          "framing": {
            "forEveryone": "The Second Amendment is an individual right. Self-defense is fundamental."
          },
          "allies": "NRA, GOA, state organizations, sheriffs' associations",
          "opposition": "Gun control organizations, some law enforcement leadership"
        },
        {
          "title": "Parental Rights & Due Process",
          "viability": "high",
          "level": "State (primary) + Federal",
          "problem": [
            "Schools withhold information from parents",
            "Parents excluded from curriculum decisions",
            "Government overreach in family matters",
            "Administrative proceedings lack meaningful due process"
          ],
          "positions": [
            "Parents have fundamental right to direct upbringing of children",
            "Educational choice — school selection without government restriction",
            "Curriculum transparency — right to know what children are taught",
            "Medical decisions — parental consent for child medical treatment",
            "Protection from state overreach in family matters",
            "Notification requirements before school involvement in sensitive matters",
            "Administrative proceedings must provide meaningful due process",
            "Right to confront accusers in all consequential proceedings",
            "Qualified immunity reform — accountability for constitutional violations"
          ],
          "framing": {
            "forEveryone": "Parents — not bureaucrats — direct the upbringing of their children. Due process protects everyone."
          },
          "allies": "Parents' organizations, educational choice advocates",
          "opposition": "Teachers unions (some issues), government agencies"
        },
        {
          "title": "Homeschool & Educational Freedom",
          "viability": "high",
          "level": "State (education law is state-specific)",
          "problem": [
            "Some states imposing increasing regulations on homeschooling families",
            "Attempts to require government curriculum approval",
            "Homeschooling used as pretext for CPS investigations",
            "College admissions discrimination against homeschool graduates",
            "Employer discrimination against homeschool credentials",
            "Regulatory burden making homeschooling difficult for working families"
          ],
          "positions": [
            "Fundamental Right: Recognize parental right to direct education as fundamental right",
            "State Constitutional Amendment: Enshrine homeschool rights in state constitutions",
            "No Prior Approval: Parents should not need government permission to homeschool",
            "Curriculum Freedom: No government approval of homeschool curriculum required",
            "Testing Optional: Standardized testing should not be mandatory for homeschoolers",
            "College Admission: Prohibit discrimination against homeschool credentials in public university admissions",
            "Employment: Homeschool diplomas treated equally with public school diplomas for employment",
            "Athletic/Extracurricular Access: Homeschoolers can participate in public school activities",
            "No CPS Presumption: Homeschooling alone is not grounds for CPS investigation",
            "Education Not Abuse: Educational choices (curriculum, approach) cannot constitute neglect",
            "Reporter Training: Train mandatory reporters that homeschooling is legal and normal"
          ],
          "framing": {
            "forConservatives": "Parental rights. Educational freedom. Government has no business dictating curriculum.",
            "forProgressives": "Respect diverse educational approaches. Not all learning happens in traditional classrooms.",
            "forParents": "You know your children better than bureaucrats. Freedom to tailor education to your child."
          },
          "momentum": "Homeschool community is large, organized, and politically active. HSLDA and state organizations provide model legislation and advocacy support. Post-COVID homeschooling increased dramatically — expanded constituency.",
          "allies": "HSLDA, state homeschool organizations, religious liberty groups, parental rights organizations",
          "opposition": "Teachers unions, some education bureaucracies"
        },
        {
          "title": "Jury Rights & Nullification Awareness",
          "viability": "low-mod",
          "level": "State (jury instructions are state-specific)",
          "problem": [
            "Jurors not informed of their historical right to judge the law as well as facts",
            "Judges instruct juries they 'must' follow the law as given — historically inaccurate",
            "Citizens serving as jurors unaware of their power as check on unjust laws",
            "Jury nullification — while legal — is actively suppressed by courts",
            "Jurors can be dismissed or even punished for expressing nullification views",
            "Defense attorneys prohibited from arguing nullification in most courts"
          ],
          "positions": [
            "Fully Informed Jury: Require courts to inform jurors they may vote conscience, not just facts",
            "Historical Context: Inform jurors of jury's traditional role as check on government power",
            "No Punishment for Verdicts: Explicitly protect jurors from prosecution for their verdicts",
            "Defense Argument: Allow defense to argue jury may consider justice of the law",
            "School Curriculum: Include jury rights in civics education",
            "Voter Information: Inform citizens of jury rights in voter information materials",
            "Public Awareness: Support public education campaigns about jury rights"
          ],
          "framing": {
            "forConservatives": "Jury is the final check on government overreach. Citizens, not judges, have ultimate power.",
            "forProgressives": "Juries have historically protected against unjust laws — fugitive slave laws, prohibition, etc.",
            "forLibertarians": "Victimless crime convictions require jury consent. Informed juries protect liberty.",
            "historical": "John Adams, Thomas Jefferson, and the Founders explicitly endorsed jury nullification."
          },
          "viabilityNote": "Jury nullification is controversial within legal establishment. Courts actively resist. More achievable: (1) educate public about jury rights outside courtroom, (2) pursue Fully Informed Jury legislation in receptive states, (3) protect jurors from punishment for verdicts.",
          "allies": "Fully Informed Jury Association, libertarians, criminal justice reformers, some civil liberties groups",
          "opposition": "Judicial establishment, prosecutors, legal establishment"
        }
      ]
    },
    {
      "id": "technology-communications",
      "slug": "technology-communications",
      "title": "Technology & Communications Freedom",
      "icon": "Wifi",
      "color": "#06B6D4",
      "description": "Technology infrastructure should serve citizens, not entrench monopolies. Regulatory barriers that protect incumbents must be removed to enable competition and innovation. This is not about regulating tech — it's about removing government-created barriers to competition.",
      "subPolicies": [
        {
          "title": "Community Broadband Freedom",
          "viability": "mod-high",
          "level": "State (primary — repeal bans); Federal (preemption, subsidies)",
          "problem": [
            "~20 states have laws restricting or banning municipal broadband",
            "Pole attachment rules favor incumbents and block new entrants",
            "Franchise agreements create local monopolies",
            "Billions in public subsidies given without open access requirements",
            "Rural areas underserved because incumbents won't build",
            "Prices artificially high due to lack of competition",
            "Incumbents sue community projects into submission"
          ],
          "positions": [
            "Repeal municipal broadband bans (19 states have restrictions)",
            "Pole attachment reform: Standardize rates and timelines for competitive access",
            "Dig-once policies: Install conduit when roads are opened for any construction",
            "Streamline permitting for new entrants",
            "End exclusive franchise arrangements",
            "Subsidy accountability: Any ISP receiving public funds must provide open access to that infrastructure",
            "Public infrastructure sharing: Fiber on public rights-of-way available to competitors",
            "Middle-mile open access: Backbone infrastructure (often publicly subsidized) open to retail competitors",
            "Federal: Preempt state bans on municipal broadband",
            "Federal: Condition federal broadband subsidies on open access",
            "Federal: Dedicated funding for community-owned networks",
            "Federal: Spectrum allocation for community wireless projects"
          ],
          "framing": {
            "forConservatives": "Anti-crony capitalism — incumbents used government to crush competition. This is NOT regulation; it's DEREGULATION of barriers incumbents created.",
            "forRuralAmerica": "Monopolists won't serve you; community networks will.",
            "forEveryone": "Lower prices through actual competition. You hate your ISP because they have no competition."
          },
          "successfulModels": "Chattanooga, TN (EPB): City-owned utility provides gigabit fiber — among fastest and cheapest internet in US. Rural Electric Co-op Broadband: Rural electric co-ops in multiple states adding fiber to existing infrastructure. Utopia Fiber (Utah): Public entity builds infrastructure; private ISPs compete for retail customers. Community Wireless: NYC Mesh, Detroit Community Technology — mesh networks built by volunteers.",
          "allies": "Municipal associations, rural communities, digital equity advocates",
          "opposition": "ISP lobby (extremely well-funded)"
        },
        {
          "title": "Digital Rights & Platform Accountability",
          "viability": "moderate",
          "level": "State (privacy laws proliferating) + Federal",
          "problem": [
            "Companies collect and sell personal data without meaningful consent",
            "Government surveillance programs lack oversight",
            "No transparency in content moderation",
            "Users locked into platforms with no data portability",
            "Algorithmic manipulation without user knowledge"
          ],
          "positions": [
            "Data Privacy: Right to know what data is collected",
            "Data Privacy: Right to delete personal data",
            "Data Privacy: Right to opt out of data sale",
            "Data Privacy: Data minimization requirements",
            "Data Privacy: Special protections for children's data",
            "Platform Accountability: Transparency in content moderation (what rules, how enforced)",
            "Platform Accountability: Appeals process for account actions",
            "Platform Accountability: Prohibition on government-directed censorship",
            "Platform Accountability: User right to chronological feed options",
            "Platform Accountability: Data portability and interoperability",
            "Algorithm Transparency: Disclosure of how recommendation algorithms work",
            "Algorithm Transparency: Ability to opt out of algorithmic curation",
            "Algorithm Transparency: Independent auditing of algorithmic bias"
          ],
          "framing": {
            "forEveryone": "Your data is yours. You deserve to know how platforms are manipulating what you see."
          },
          "allies": "Privacy advocates, civil liberties groups (on different aspects)",
          "opposition": "Big Tech"
        },
        {
          "title": "AI & Algorithmic Accountability",
          "viability": "moderate",
          "level": "State (for state agencies) + Federal (for federal agencies, broad standards)",
          "problem": [
            "AI systems increasingly making consequential decisions (credit, employment, criminal justice)",
            "'Black box' algorithms with no transparency or appeal process",
            "Government agencies adopting AI without due process protections",
            "Predictive policing and pre-crime risk assessments without accountability",
            "No requirement to disclose when AI is making decisions about citizens",
            "Algorithmic bias baked into systems with no correction mechanism",
            "Social scoring potential — China's system as cautionary tale"
          ],
          "positions": [
            "Right to Human Review: Any consequential government AI decision must have human appeal option",
            "Algorithm Disclosure: Government agencies must disclose when AI is used in decisions affecting citizens",
            "Bias Auditing: Require independent audits of government AI systems",
            "Explainability Requirement: Government AI must be able to explain basis for decisions",
            "No Predictive Punishment: Cannot penalize citizens based on predicted future behavior",
            "Ban Social Scoring: Prohibit government use of social credit-style scoring systems",
            "No Behavioral Scoring: Government services cannot be conditioned on behavioral scores",
            "Private Score Restrictions: Limit use of third-party social scores by government contractors",
            "Data Aggregation Limits: Restrict government aggregation of personal data for scoring purposes",
            "Private Sector Disclosure: Companies must disclose when AI makes consequential decisions",
            "Explanation Rights: Right to explanation when denied credit, employment, housing based on AI",
            "Human Alternative: Option for human review when AI makes adverse decisions",
            "Bias Testing: Require testing for discriminatory outcomes in high-stakes AI"
          ],
          "framing": {
            "forConservatives": "Government should not use opaque algorithms to control citizens. Due process applies to AI decisions.",
            "forProgressives": "AI bias perpetuates discrimination. Protect marginalized communities from algorithmic injustice.",
            "forLibertarians": "Prevent surveillance state from using AI for social control. China's system is the warning.",
            "forEveryone": "You deserve to know when a computer is making decisions about your life."
          },
          "emergingIssueNote": "AI governance is rapidly evolving. Focus on clear principles (transparency, due process, human oversight) rather than specific technical requirements that may become outdated. This is an area where early advocacy can shape the regulatory framework before it solidifies.",
          "allies": "Civil liberties groups, privacy advocates, algorithmic justice organizations, some tech reformers",
          "opposition": "AI vendors, some government agencies, surveillance-state advocates"
        }
      ]
    },
    {
      "id": "monetary-financial-reform",
      "slug": "monetary-financial-reform",
      "title": "Monetary & Financial Reform",
      "icon": "DollarSign",
      "color": "#F97316",
      "description": "Our debt-based fiat monetary system creates structural problems. While fundamental reform is a generational project, intermediate steps can increase transparency and accountability. Distinguish between near-term achievable reforms and long-term educational/movement-building goals.",
      "strategicReality": "Fundamental monetary reform requires broad public understanding and significant political change. Going straight at the Federal Reserve is tilting at windmills until there's a massive movement. Focus on transparency and education first while pursuing achievable state-level sound money policies.",
      "systemProblems": [
        "Money created through debt — expansion requires more borrowing",
        "Federal Reserve operates with limited transparency",
        "Currency debasement through inflation transfers wealth",
        "Boom-bust cycles amplified by monetary policy",
        "Dollar as global reserve currency distorts domestic economy",
        "National debt mathematically unsustainable under current system"
      ],
      "subPolicies": [
        {
          "title": "Federal Reserve Transparency & Sound Money Steps",
          "viability": "moderate",
          "level": "Federal (transparency) + State (sound money)",
          "problem": [
            "Federal Reserve operates with limited transparency",
            "Minimal accountability for monetary policy decisions",
            "State pension funds and reserves cannot diversify into sound assets",
            "Gold and silver transactions taxed despite being money alternatives"
          ],
          "positions": [
            "Federal Reserve Transparency: Audit the Fed — full, comprehensive audit of Federal Reserve operations",
            "Real-Time Disclosure: Immediate disclosure of Fed interventions and transactions",
            "Inspector General Authority: Strengthen IG oversight of Federal Reserve",
            "Congressional Testimony: More frequent, more substantive reporting to Congress",
            "State Gold Depositories: State-level gold reserves (Texas model)",
            "Legal Tender Laws: Remove sales tax and capital gains tax on gold/silver",
            "Sound Money Defense: Protect right to transact in alternative currencies",
            "State Reserve Diversification: Allow states to hold reserves in gold/silver"
          ],
          "framing": {
            "forEveryone": "Why is the Fed the only agency Congress won't audit? Transparency is accountability."
          },
          "strategicApproach": "Phase 1 — Education: Build public understanding of monetary system. Phase 2 — Transparency: Audit the Fed, require disclosure. Phase 3 — Alternatives: Enable competing currencies, state sound money. Phase 4 — Reform: Build toward fundamental restructuring.",
          "allies": "Sound money advocates, state legislators, fiscal conservatives",
          "opposition": "Federal Reserve, banking establishment"
        },
        {
          "title": "Central Bank Digital Currency (CBDC) Opposition",
          "viability": "high",
          "level": "State (immediate) + Federal (longer-term)",
          "problem": [
            "Federal Reserve actively exploring digital dollar",
            "CBDCs enable unprecedented financial surveillance — government sees every transaction",
            "Programmable money: government could restrict what you can buy (no ammunition, no donations to disfavored groups)",
            "Expiring money: government could program currency to expire, forcing spending",
            "Instant account freezing: no due process needed to cut off your finances",
            "Social credit potential: link financial access to behavior scores",
            "China already implementing digital yuan with these features"
          ],
          "positions": [
            "State-Level CBDC Ban: Prohibit state agencies from accepting or requiring CBDC for payments",
            "Anti-Surveillance: Prohibit state use of CBDC transaction data for surveillance",
            "Cash Preservation: Mandate businesses accept cash; prohibit 'cashless' mandates",
            "Financial Privacy: Strengthen state financial privacy protections",
            "Alternative Currency Protection: Protect right to transact in gold, silver, cryptocurrency",
            "Federal: Require Congressional Approval — No CBDC implementation without explicit congressional authorization",
            "Federal: Privacy Requirements — Any digital dollar must have cash-equivalent privacy protections",
            "Federal: Non-Programmable — Prohibit programmable features that restrict spending",
            "Federal: Voluntary Only — CBDC cannot be mandatory; cash must remain legal tender",
            "Federal: No Surveillance — Transaction data cannot be used for surveillance, profiling, or social scoring"
          ],
          "framing": {
            "forConservatives": "Government surveillance of every purchase. Social credit score. Financial cancel culture.",
            "forProgressives": "What happens when Trump or DeSantis controls programmable money? Protect marginalized communities from financial exclusion.",
            "forLibertarians": "End of financial privacy. Government control of every transaction.",
            "forEveryone": "Your money, your business. Keep cash. Preserve financial freedom."
          },
          "momentum": "Florida, North Carolina, and other states have already passed CBDC restrictions. This is a high-viability issue with active legislative momentum. Model legislation is available from multiple liberty-focused organizations.",
          "allies": "Privacy advocates, libertarians, cryptocurrency community, cash advocates",
          "opposition": "Federal Reserve, financial surveillance interests, some fintech"
        },
        {
          "title": "Sound Currency System",
          "viability": "low-mod",
          "level": "Federal",
          "problem": [
            "USD debt is past the point of no return — stopping it now would crash the economy",
            "National debt denominated in USD must go untethered; it's too late to fix",
            "Currency debasement through inflation is inevitable under current system",
            "No amount of fiscal discipline can solve a structural monetary problem",
            "Citizens need an alternative that preserves purchasing power"
          ],
          "positions": [
            "Asset-Backed Currency: Treasury issues new currency backed by basket of real assets",
            "Backing Basket: Gold, commodities, digital commodities (crypto), land, and other tangible assets",
            "Debt Ceiling: Sound currency debt cannot exceed 10% of domestic production (GNP)",
            "No Unbacked Issuance: Cannot create sound currency without corresponding assets",
            "Transparency: Full disclosure of backing assets and their valuation",
            "USD Continues: Existing USD remains in circulation, will inflate away naturally",
            "Parallel Systems: Sound currency runs alongside USD during transition",
            "Market Rates: Exchange rate between currencies floats freely",
            "Government Operations: Taxes, tariffs, and salaries paid in Treasury-issued sound currency"
          ],
          "framing": {
            "coreInsight": "The patient (USD) is terminal. Rather than pretend we can save it, build a lifeboat (sound currency) while managing the decline.",
            "forSavers": "Protect your purchasing power from inflation with real asset backing.",
            "forFiscalConservatives": "Enforced discipline — cannot issue sound currency debt beyond 10% of production.",
            "forEveryone": "Honest money that measures what the dollar is actually worth."
          },
          "allies": "Sound money advocates, gold standard supporters, fiscal conservatives, Austrian economists",
          "opposition": "Federal Reserve, banking establishment, deficit spenders, MMT advocates"
        },
        {
          "title": "Federal Reserve Privatization",
          "viability": "low",
          "level": "Federal",
          "problem": [
            "Fed operates in quasi-governmental gray zone with special privileges",
            "Not subject to normal regulatory oversight despite controlling money supply",
            "Ownership structure is opaque and unique",
            "Profits from money creation accrue to private member banks",
            "Accountability to neither markets nor democratic institutions"
          ],
          "positions": [
            "Private Corporation: Federal Reserve becomes formally private, no longer quasi-governmental",
            "Current Ownership: Member banks retain ownership (or true owners step forward)",
            "Standard Regulation: Subject to same regulatory environment as all other financial institutions",
            "No Special Privileges: Competes with other currency issuers on equal footing",
            "Ownership Disclosure: Publicly disclosed within 100 days of enactment",
            "Ongoing Disclosure: Ownership disclosed annually for 100 years (special case for this entity)",
            "Financial Reporting: Same requirements as public companies",
            "Regulatory Audits: Subject to standard banking examinations"
          ],
          "framing": {
            "designRationale": "If the Fed is going to continue printing USD and managing that currency's decline, it should do so as a private entity competing in the market, not as a privileged quasi-governmental institution. Let it sink or swim with its monetary decisions."
          },
          "allies": "End the Fed movement, sound money advocates, libertarians, some populists",
          "opposition": "Federal Reserve, banking establishment, mainstream economists"
        },
        {
          "title": "Currency Competition & Banking Reform",
          "viability": "low-mod",
          "level": "Federal",
          "problem": [
            "Legal tender laws force use of depreciating currency",
            "Fractional reserve banking creates money through lending reserves banks don't have",
            "Depository and investment banking functions dangerously mixed",
            "Cryptocurrency treated as securities rather than currency",
            "No meaningful competition for government-issued currency"
          ],
          "positions": [
            "Repeal Legal Tender Laws: Citizens choose which currencies to accept",
            "Free Market Currency: Any organization can issue currency subject to fraud laws",
            "No Forced Adoption: Government cannot force citizens to use specific currency",
            "Cryptocurrency Status: Crypto treated as currency, not securities",
            "Contract Enforcement: Courts enforce contracts at stated rates",
            "End Fractional Reserve: No more creating money through lending reserves you don't have",
            "Clear Separation: Depository banks (custody, fees, no risk) vs. Investment banks (risk, returns)",
            "Bank-Issued Currency: Banks can issue currency following standard regulations",
            "No Muddying: Treating depository banks as investment banks creates systemic risk — stop it"
          ],
          "framing": {
            "historical": "Free banking worked in America before 1913. Multiple currencies competed. Bad money failed; good money succeeded.",
            "forConservatives": "Market competition beats government monopoly — including for money.",
            "forProgressives": "Break the bank cartel. End too-big-to-fail by ending the practices that create it.",
            "forLibertarians": "Monetary freedom. Use whatever money you want."
          },
          "transitionNote": "This requires significant legal and institutional changes. Gresham's Law dynamics apply — people may hoard sound currency and spend USD, accelerating USD decline. This is a feature, not a bug, but the transition requires careful management.",
          "allies": "Cryptocurrency community, Austrian economists, sound money advocates, libertarians",
          "opposition": "Banking establishment, Federal Reserve, mainstream economists, regulators"
        }
      ]
    },
    {
      "id": "political-system-reform",
      "slug": "political-system-reform",
      "title": "Political System Reform",
      "icon": "Users",
      "color": "#A855F7",
      "description": "The two-party duopoly limits voter choice and accountability. While parties cannot be banned (freedom of association), structural reforms can weaken party control and enable alternatives. The goal is more competition and accountability, not picking winners.",
      "subPolicies": [
        {
          "title": "Ballot Access Reform",
          "viability": "moderate",
          "level": "State",
          "problem": [
            "Major parties write ballot access laws to exclude competitors",
            "Third parties need hundreds of thousands of signatures in some states",
            "Petition deadlines months before election",
            "Signature verification designed to disqualify"
          ],
          "positions": [
            "Equal requirements for all parties and candidates",
            "Reasonable signature requirements (low percentage of voters)",
            "Reasonable deadlines (not 6+ months before election)",
            "Clear, fair signature verification process",
            "Automatic ballot access if received minimum vote percentage in prior election"
          ],
          "framing": {
            "forEveryone": "Two parties don't represent everyone. Open the system to competition."
          },
          "allies": "Third parties, independent candidates, electoral reform groups",
          "opposition": "Major parties benefit from status quo"
        },
        {
          "title": "Electoral System Alternatives",
          "viability": "moderate",
          "level": "State (primarily) + Local",
          "problem": [
            "Winner-take-all voting creates spoiler effect",
            "Voters afraid to 'waste' vote on third-party candidates",
            "Primaries reward appealing to partisan base, not general electorate",
            "Two-party dominance entrenched by electoral mechanics"
          ],
          "positions": [
            "Ranked Choice Voting (RCV): Voters rank candidates in order of preference",
            "RCV Benefits: Eliminates 'spoiler' concern; encourages more civil campaigns",
            "RCV Status: Used in Alaska, Maine, and many localities",
            "Open/Nonpartisan Primaries: All candidates on single primary ballot regardless of party",
            "Top-N Advance: Top 2, 4, or 5 advance to general election",
            "Open Primary Benefits: Reduces incentive to appeal only to partisan base",
            "Open Primary Examples: California, Washington (top-two); Alaska (top-four + RCV)",
            "Approval Voting: Vote for any/all candidates you approve of (no ranking required)",
            "Approval Voting Benefits: Simpler than RCV — no complex counting or runoffs; eliminates spoiler effect",
            "Approval Voting Status: Successfully used in Fargo, ND and St. Louis, MO",
            "Approval Voting Advantage: Easier to explain, count, and audit than RCV"
          ],
          "framing": {
            "forEveryone": "Better voting systems give voters real choices without fear of wasting their vote."
          },
          "allies": "Electoral reform organizations, FairVote, third parties",
          "opposition": "Major parties, some election administrators concerned about complexity"
        },
        {
          "title": "Debate Access Reform",
          "viability": "low",
          "level": "Federal (presidential) + State",
          "problem": [
            "Presidential debate commission controlled by two major parties",
            "15% polling threshold effectively excludes all third-party candidates",
            "Debates treated as private events rather than public forums",
            "Voters denied opportunity to hear alternative perspectives"
          ],
          "positions": [
            "Lower threshold for debate inclusion (not just major party nominees)",
            "Objective, transparent criteria for participation",
            "Independent commission (not controlled by two parties)",
            "Multiple debate formats to provide access to more candidates"
          ],
          "framing": {
            "forEveryone": "Voters deserve to hear from all serious candidates, not just the two-party picks."
          },
          "allies": "Third parties, independent candidates, some media organizations",
          "opposition": "Commission on Presidential Debates, major parties"
        }
      ]
    },
    {
      "id": "foreign-policy",
      "slug": "foreign-policy",
      "title": "Foreign Policy & National Interest",
      "icon": "Globe",
      "color": "#EC4899",
      "description": "America's foreign policy should prioritize American interests, security, and sovereignty. Resources spent abroad should be accountable and justified. We are not isolationists — we are nationalists who believe American policy should serve American citizens.",
      "subPolicies": [
        {
          "title": "Foreign Aid Accountability",
          "viability": "low-mod",
          "level": "Federal",
          "problem": [
            "US provides ~$50+ billion annually in foreign assistance",
            "Limited accountability for how money is spent",
            "Aid often goes to corrupt governments",
            "Some aid undermines stated US interests",
            "Domestic needs unmet while billions flow overseas"
          ],
          "positions": [
            "Comprehensive Audit: Full audit of all foreign aid programs and recipients",
            "Country-by-Country Review: Annual justification for aid to each country",
            "Outcome Metrics: Measurable goals and consequences for failure",
            "Corruption Conditions: No aid to governments failing anti-corruption standards",
            "Sunset Provisions: Aid programs expire unless reauthorized with justification",
            "Congressional Approval: Major aid packages require congressional vote"
          ],
          "longerTermGoals": [
            "Substantial reduction in overall foreign aid (50%+ reduction)",
            "Redirect savings to domestic priorities",
            "Maintain only aid with clear national security justification",
            "End aid to nations hostile to US interests",
            "Phase-out timeline for dependent nations"
          ],
          "framing": {
            "forConservatives": "America first. Stop sending billions abroad while American communities struggle.",
            "forProgressives": "Demand accountability for how our tax dollars are spent overseas.",
            "forEveryone": "Foreign aid should serve American interests, not prop up corrupt governments."
          },
          "allies": "Fiscal conservatives, America-first groups",
          "opposition": "Foreign policy establishment, recipient governments, contractors"
        },
        {
          "title": "Immigration Reform: Open Borders with Accountability",
          "viability": "mod-high",
          "level": "Federal (requires comprehensive reform)",
          "compromiseNote": "This position synthesizes legitimate concerns from both conservative and progressive perspectives. Conservative concerns: Rule of law, national sovereignty, fiscal burden, assimilation. Progressive concerns: Human dignity, economic opportunity, family unity, avoiding draconian enforcement. Our position: Open doors, high expectations, zero tolerance for failure.",
          "problem": [
            "Broken immigration system serves no one well",
            "Current illegal presence must be addressed — no amnesty, no permanent underclass",
            "Legal immigration process is slow, unpredictable, and arbitrary",
            "Border security undermined by inconsistent enforcement"
          ],
          "positions": [
            "Sovereignty + Openness: Nations have the right to control borders AND to welcome those who will contribute",
            "Rule of Law: Current illegal presence must be addressed — no amnesty, no permanent underclass",
            "Merit through Behavior: Judge immigrants by what they DO, not where they're from",
            "Self-Sufficiency: America welcomes contributors, not dependents",
            "Second Chances, Not Infinite Chances: Opportunity comes with accountability"
          ],
          "phaseOneEnforcement": [
            "Remove All Current Illegal Residents: Systematic, humane removal of those present illegally",
            "Secure Physical Border: Physical barriers, technology, and personnel where effective",
            "End Catch-and-Release: Detain or return — no release into interior",
            "Interior Enforcement: E-Verify mandatory; employer penalties; visa overstay tracking",
            "No Sanctuary Policies: State/local cooperation with federal immigration enforcement"
          ],
          "phaseTwoOpenImmigration": [
            "Minimal Barriers to Entry: Anyone may enter legally who is not convicted of violent/serious crimes, known terrorist, carrying communicable diseases, or previously deported for cause",
            "Streamlined Processing: Days or weeks, not years",
            "No Country Quotas: Judge individuals, not nationalities",
            "No Lottery: Predictable, merit-based (behavior merit, not credential merit)"
          ],
          "probationaryPeriod": [
            "2-year probationary period with clear expectations",
            "No Public Benefits: Zero access to welfare, food stamps, housing assistance, Medicaid",
            "Full Tax Obligation: Pay all taxes from day one — same as citizens",
            "Self-Sufficiency Required: Must maintain housing and employment",
            "Criminal Accountability: Any conviction for non-trivial offense = immediate deportation",
            "No Chain Migration: Cannot sponsor relatives during probationary period"
          ],
          "afterProbation": [
            "Full Resident Status: Eligible for permanent residency",
            "Benefit Eligibility: Access to social safety net (having contributed for 2 years)",
            "Path to Citizenship: Standard naturalization process available",
            "Family Sponsorship: May sponsor immediate family (who also enter probationary status)"
          ],
          "framing": {
            "forConservatives": "Rule of law restored. No more illegal immigration. No free ride. Immigrants must prove themselves.",
            "forProgressives": "Genuinely open borders for anyone willing to work. No discrimination by country. Humane, legal pathway.",
            "forLibertarians": "Free movement of labor. Minimal government barriers. Self-selection of productive individuals.",
            "forEveryone": "We get immigrants who WANT to contribute and prove it through action, not paperwork."
          },
          "challenges": [
            "Mass removal: Logistically complex, emotionally difficult, legally contested",
            "Defining 'contribution': Who decides? What standards? Bureaucratic discretion concerns",
            "Enforcement gaps: Probationary violations require robust tracking and enforcement",
            "Political will: Neither party fully embraces this — too open for right, too accountable for left"
          ],
          "allies": "Rule-of-law conservatives, libertarians, legal immigrants, working-class Americans",
          "opposition": "Open-borders absolutists, amnesty advocates, some business interests (want cheap exploitable labor)"
        },
        {
          "title": "Dual Citizenship in Government",
          "viability": "low-mod",
          "level": "Federal (legislation)",
          "framingNote": "This is NOT about ethnicity, religion, or national origin. This is about formal legal obligations to foreign governments that create potential conflicts of interest. A naturalized citizen who has renounced prior citizenship has no such conflict.",
          "problem": [
            "Dual citizens may owe military service, taxes, or other obligations to foreign governments",
            "Security clearance standards already consider foreign ties",
            "Elected officials and senior appointees make decisions affecting foreign nations",
            "Appearance of divided loyalty undermines public trust"
          ],
          "positions": [
            "Elected Officials: Federal elected officials should not hold citizenship of any foreign nation",
            "Senior Appointees: Cabinet members and senior officials should renounce foreign citizenship",
            "Security Positions: Apply existing security clearance standards consistently",
            "Disclosure: At minimum, require disclosure of any foreign citizenships",
            "Judicial Nominees: Federal judges should not hold foreign citizenship"
          ],
          "implementationChallenges": [
            "Constitutional questions: Can citizenship requirements be added to elected office?",
            "Political sensitivity: Will be mischaracterized regardless of framing",
            "Enforcement: Some countries don't recognize renunciation",
            "Scope: How far down the government hierarchy?"
          ],
          "framing": {
            "forConservatives": "American officials should have undivided loyalty to America.",
            "forProgressives": "Transparency and accountability in government — know who your leaders serve.",
            "forEveryone": "Those who make decisions for America should be accountable only to America."
          },
          "allies": "National security hawks, sovereignty advocates",
          "opposition": "Civil liberties groups (framing concerns), affected communities"
        },
        {
          "title": "War & Military Intervention: Defense Only",
          "viability": "mod-high",
          "level": "Federal (Congress must reclaim war powers)",
          "corePrinciple": "No War Unless American Lives Are At Risk. War means killing people — including inevitable innocent bystanders. This requires justification beyond 'interests.' No nation-state has attacked American soil since Pearl Harbor. Our recent wars have been choices, not necessities. Economic reasons are not sufficient justification to kill people.",
          "problem": [
            "Forever wars with no clear exit strategy or measurable victory conditions",
            "Congress has abdicated war-making authority to the executive branch",
            "Military-industrial complex profits from endless conflict",
            "American blood and treasure spent on other nations' conflicts",
            "Last attack on US soil by nation-state: Pearl Harbor (1941)"
          ],
          "noWarPositions": [
            "No war in the Middle East — Not our conflict; not worth American lives",
            "No war with China — Competition yes, war no",
            "No war with Russia — Not our border, not our war",
            "No war with Iran — Containment and deterrence, not invasion",
            "No war with North Korea — Deterrence works",
            "No war with Venezuela — Not a threat to American lives",
            "No 'humanitarian' interventions — Our military exists to protect Americans, not remake the world",
            "No regime change operations — History shows these fail catastrophically"
          ],
          "whenWarIsJustified": [
            "Attack on American soil: Direct attack on US territory triggers full defensive response",
            "Attack on Americans: Large-scale attack killing American citizens (e.g., 9/11-scale terrorism)",
            "Imminent verified threat: Confirmed imminent attack on American soil — not speculative 'WMD' claims",
            "Defense of territories: Attack on US territories, possessions, or military installations"
          ],
          "notJustifiedFor": [
            "Economic interests: Oil, trade routes, resources — not worth killing for",
            "Spreading democracy: Not our job; doesn't work anyway",
            "Humanitarian concerns: Tragic, but not a military mission",
            "Protecting 'interests' abroad: Vague 'interests' have justified every failed war",
            "Honoring alliance commitments: Alliances should be defensive, not offensive",
            "Maintaining 'credibility': Credibility doesn't require endless war",
            "Preemption based on speculation: 'They might attack someday' is not justification"
          ],
          "defenseInvestment": [
            "Mainland Defense: Anti-missile systems, air defense, coastal defense — make attacking US soil impossible",
            "Satellite Locations: Defend territories (Guam, Puerto Rico, etc.) with serious defensive capability",
            "Cyber Defense: Protect critical infrastructure from cyber attack",
            "Border Security: Actual security, not just enforcement theater",
            "Nuclear Deterrent: Maintain credible second-strike capability",
            "Domestic Manufacturing: Defense industrial base should not depend on foreign supply chains"
          ],
          "protectingAmericansAbroad": [
            "Consular Services: Robust embassy/consular support for Americans in trouble",
            "Evacuation Capability: Ability to extract Americans from dangerous situations",
            "Legal Assistance: Help Americans navigate foreign legal systems",
            "Diplomatic Pressure: Use diplomatic channels to protect American citizens",
            "Hostage Recovery: Negotiation, intelligence, targeted operations — not invasion",
            "NOT War: An American getting in trouble abroad does not justify invading countries"
          ],
          "allianceReform": [
            "Defensive Only: US alliances should be defensive — we defend allies if attacked, not if they start wars",
            "Burden Sharing: Allies must contribute meaningfully to their own defense",
            "No Tripwire Forces: Don't station troops where their death automatically triggers war",
            "Congressional Approval: No president can commit US to war without Congress",
            "Treaty Review: Review all defense commitments — which still serve American interests?",
            "Withdrawal Timelines: Phase out forward deployments that serve allies more than America"
          ],
          "taiwanPosition": [
            "Taiwan is NOT American soil. Taiwanese are not American citizens.",
            "Strategic Reality: Current interest is semiconductor supply chain, not Taiwan itself",
            "Solution: Broker a 20-year transition deal with China",
            "During 20 Years: Build complete domestic chip manufacturing capability",
            "After 20 Years: Exit Taiwan in totality. The fate of Taiwan is between China and the Taiwanese.",
            "Principle: We don't fight wars over other people's territory. We solve our strategic vulnerabilities through investment, not blood."
          ],
          "framing": {
            "forConservatives": "Put America first. Stop spending American blood and treasure on other people's wars. Rebuild military for defense, not empire.",
            "forProgressives": "End the forever wars. Stop killing innocent civilians abroad. Invest in America instead of bombs.",
            "forVeterans": "Your lives are too valuable to waste on wars of choice. We should only send you to fight when America is actually threatened.",
            "forEveryone": "War means killing people, including innocent bystanders. That requires real justification. 'Interests' isn't enough."
          },
          "historicalRecord": "Last attack on US soil: Pearl Harbor (1941) — nation-state attack; 9/11 (2001) — non-state actors. Recent wars: Iraq, Afghanistan, Libya, Syria involvement — all choices, not defensive necessities. Results: Trillions spent, thousands of American lives lost, hundreds of thousands of foreign civilians killed, regions destabilized.",
          "allies": "Non-interventionist conservatives, anti-war progressives, libertarians, veterans groups (some), fiscal conservatives",
          "opposition": "Military-industrial complex, neoconservatives, foreign policy establishment, defense contractors"
        }
      ]
    },
    {
      "id": "healthcare-reform",
      "slug": "healthcare-reform",
      "title": "Healthcare System Reform",
      "icon": "Activity",
      "color": "#14B8A6",
      "description": "Healthcare markets should not be consolidated to a few large players. No government policy should enrich a subset of companies in an industry. If a function that generates significant revenue is unavoidable to properly regulate, it must be an open and competitive process. Government can't pick winners. Marketplaces provide the best results.",
      "subPolicies": [
        {
          "title": "Competitive Healthcare Markets",
          "viability": "moderate",
          "level": "State (CON repeal) + Federal (Medicare bidding)",
          "problem": [
            "Hospital systems consolidated into regional monopolies",
            "PBMs (pharmacy benefit managers) control drug pricing with no transparency",
            "Certificate of Need laws prevent new hospitals from opening",
            "Regulatory capture protects incumbents from competition",
            "Prices obscured — patients can't shop for value",
            "Government programs pick winners, enriching connected companies"
          ],
          "positions": [
            "Certificate of Need Repeal: Eliminate laws requiring government permission to open healthcare facilities",
            "Price Transparency: All healthcare providers must publish prices upfront (builds on existing federal requirements)",
            "PBM Transparency: Require disclosure of rebates, spreads, and pricing arrangements",
            "Anti-Consolidation: Strengthen antitrust enforcement in healthcare mergers",
            "Competitive Bidding: Any government healthcare spending must use competitive bidding — no sole-source contracts",
            "Cash Pay Options: Providers must offer cash prices; payments in any currency accepted"
          ],
          "emergencyCare": [
            "Emergency care is a business — businesses compete",
            "If costs aren't obscured and payments are made in cash (any currency), working emergency systems are achievable",
            "Rural areas can have single facilities; if rates rise too high, competition is enabled",
            "No special exemptions for emergency care from price transparency requirements"
          ],
          "framing": {
            "corePrinciple": "Government can't pick winners to enrich. Every company should compete on equal footing.",
            "forConservatives": "End crony capitalism in healthcare. Let markets work.",
            "forProgressives": "Break up healthcare monopolies that gouge patients.",
            "forEveryone": "You deserve to know prices before treatment, not after."
          },
          "allies": "Direct primary care, patient advocates, small practices, fiscal conservatives",
          "opposition": "Hospital systems, PBMs, entrenched healthcare corporations"
        },
        {
          "title": "Insurance Market Reform",
          "viability": "low-mod",
          "level": "Federal (interstate commerce) + State (insurance regulation)",
          "problem": [
            "Insurance tied to employment — distorts market, locks workers into jobs",
            "Can't buy insurance across state lines or from unconventional sources",
            "Complex regulations benefit large insurers, crush small entrants",
            "Pre-existing conditions create coverage gaps",
            "Mandates and regulations make policies expensive"
          ],
          "retailInsuranceSales": [
            "Anywhere Sales: Insurance should be purchasable like any other good — at Costco, Walmart, online, or your neighborhood shop",
            "Operational Standards: Any seller must meet operational standards, but no artificial barriers to entry",
            "Affiliation Benefits: Your affiliations can get you access to different insurance options, but shouldn't be required",
            "Interstate Purchase: Buy insurance from any state that allows it"
          ],
          "preExistingConditions": [
            "Cannot Deny Coverage: Insurance companies cannot deny coverage to anyone",
            "Age-Banded Pricing: Policies priced by age band — younger people pay less (actuarially justified)",
            "Continuous Coverage Rule: 6-month grace period — if your last policy was within 6 months (and prior coverage exceeded 12 months), you stay in normal age-band pricing",
            "Lapse Penalty: If coverage lapses >6 months, can be assessed for prior conditions and placed at high end of age band",
            "Rate Cap: Cannot charge more than 20× average rate OR 40× lowest rate (whichever is lower)"
          ],
          "designRationale": "This system prevents the adverse selection death spiral (where only sick people buy insurance) while avoiding mandates. Continuous coverage incentivizes staying insured. Age-banding keeps premiums affordable for young people. Rate caps ensure no one is priced out entirely.",
          "positions": [
            "Allow retail insurance sales from any qualified seller",
            "Enable interstate insurance purchases",
            "Protect pre-existing conditions with continuous coverage incentives",
            "Use age-banded pricing instead of community rating",
            "Cap rates to prevent pricing out the sick"
          ],
          "framing": {
            "forConservatives": "Free market insurance without mandates. Personal responsibility rewarded.",
            "forProgressives": "No one denied coverage. Rate caps protect the sick.",
            "forEveryone": "Buy insurance anywhere, keep it when you change jobs, and know you can't be priced out."
          },
          "allies": "Health sharing ministries, direct primary care, free market healthcare advocates",
          "opposition": "Large insurers, healthcare establishment, ACA defenders"
        },
        {
          "title": "Medicare & Medicaid: Phase-Out",
          "viability": "low",
          "level": "Federal",
          "viabilityNote": "Long-term generational project",
          "problem": [
            "Government programs ARE government picking winners",
            "Medicare prices distort entire healthcare market",
            "Medicaid creates dependency and crowds out private alternatives",
            "Fraud, waste, and abuse endemic to both programs",
            "Unfunded liabilities threaten fiscal sustainability"
          ],
          "positions": [
            "Phase-Out, Not Elimination: Programs phased out over time — not immediate deprecation",
            "Protect Current Beneficiaries: Those currently dependent on programs protected during transition",
            "Tied to Alternative System Maturity: Phase-out timeline contingent on proof that alternative market-based system is working",
            "Beneficial Change Requirement: Must demonstrate beneficial change before each phase-out step",
            "No Cliff: Gradual transition with off-ramps if problems emerge"
          ],
          "strategicReality": "This is a generational project, not a near-term campaign. Medicare is politically popular and seniors vote. Focus on (1) competitive alternatives that demonstrate market healthcare can work, (2) transparency reforms that expose program waste, (3) building public understanding of fiscal unsustainability. Immediate 'abolish Medicare' campaigns are political suicide.",
          "framing": {
            "forConservatives": "End government distortion of healthcare markets. Let competition work.",
            "forProgressives": "The current system enriches corporations. A competitive system could serve patients better.",
            "forEveryone": "We need sustainable healthcare, not programs heading toward bankruptcy."
          },
          "allies": "Fiscal conservatives, free market think tanks, some libertarians",
          "opposition": "AARP, healthcare industry (major revenue source), seniors, progressives"
        }
      ]
    },
    {
      "id": "education-reform",
      "slug": "education-reform",
      "title": "Education Reform",
      "icon": "BookOpen",
      "color": "#8B5CF6",
      "description": "Education belongs to families and communities, not federal bureaucrats. You should not be forced to attend any school. The Department of Education should be at the state level. Curriculums are determined by the state and municipality, with those freedoms guaranteed by the federal level.",
      "subPolicies": [
        {
          "title": "School Choice & Vouchers",
          "viability": "mod-high",
          "level": "State (education is state power)",
          "problem": [
            "Children assigned to schools based on zip code",
            "Families with means can move or pay for private school; others are trapped",
            "Public school monopoly has no competitive pressure to improve",
            "One-size-fits-all approach fails diverse student needs",
            "Teacher unions prioritize adult interests over student outcomes"
          ],
          "positions": [
            "Universal Vouchers: Every student receives voucher worth current per-pupil spending",
            "Portable Funding: Money follows the student to any school they choose",
            "State Schools: Any school that meets state standards and accepts vouchers qualifies as 'state school'",
            "Curriculum Freedom: Schools can teach anything — but only get vouchers if they meet state standards",
            "Special Needs: Higher voucher amount for special needs students — let the market create specialized schools",
            "No Forced Attendance: Families choose; no child forced to attend any particular school"
          ],
          "standardsAccountability": [
            "State Standards: Each state sets its own curriculum standards for voucher eligibility",
            "Municipal Flexibility: Municipalities can add requirements within state framework",
            "Federal Role: Guarantee the freedom of states and localities to set standards — no federal curriculum",
            "Transparency: All schools receiving vouchers must publish outcomes data"
          ],
          "framing": {
            "forConservatives": "Parents, not bureaucrats, decide where children learn.",
            "forProgressives": "Low-income families deserve the same choices wealthy families have.",
            "forEveryone": "Competition improves quality. Let schools compete for students."
          },
          "allies": "School choice organizations, parental rights groups, many conservatives, urban education reformers",
          "opposition": "Teacher unions, public school establishment, some progressives"
        },
        {
          "title": "Eliminate Federal Department of Education",
          "viability": "low-mod",
          "level": "Federal",
          "problem": [
            "Federal involvement in education began in 1979 — outcomes have not improved",
            "Federal mandates impose one-size-fits-all requirements on diverse states",
            "Money flows to Washington, bureaucracy takes its cut, remainder returns with strings attached",
            "No constitutional authority for federal education involvement",
            "Removes education decisions from parents and communities"
          ],
          "positions": [
            "Abolish Federal DoE: Return all education authority to states",
            "Block Grant Transition: If federal money continues, block grants with no strings attached",
            "State DoE: Education departments operate at state level where they belong",
            "Federal Role Limited To: Protecting state/local freedoms, civil rights enforcement, data collection (optional)"
          ],
          "historicalContext": "The federal Department of Education was created in 1979. U.S. educational outcomes have not improved relative to other developed nations since its creation. Federal spending has increased dramatically while results have stagnated. The experiment has failed.",
          "framing": {
            "forConservatives": "Restore constitutional order. Education is a state and local matter.",
            "forProgressives": "Stop sending money to Washington bureaucracy. Keep it in communities.",
            "forEveryone": "Forty-five years of federal involvement haven't improved outcomes. Try something different."
          },
          "allies": "State sovereignty advocates, fiscal conservatives, many Republicans",
          "opposition": "Education establishment, teacher unions, federal bureaucracy"
        },
        {
          "title": "Higher Education Reform",
          "viability": "moderate",
          "level": "Federal",
          "problem": [
            "Federal student loans have inflated tuition massively",
            "$1.7+ trillion in student debt, much of it for low-value degrees",
            "Universities captured unlimited government-backed money flow",
            "Administrative bloat funded by easy credit",
            "Students take on debt without understanding ROI"
          ],
          "positions": [
            "End Federal Guarantees: Government should not fund or guarantee higher education loans",
            "K-12 First: Government must make primary and secondary education work properly before getting involved in higher ed",
            "Skin in the Game: If loans continue, universities should share default risk",
            "Outcome Disclosure: Require schools to disclose graduate employment and earnings data by major",
            "Alternative Pathways: Support vocational training, apprenticeships, and non-degree credentials"
          ],
          "framing": {
            "corePrinciple": "Fix K-12 first. A broken foundation can't support a good system above it.",
            "forYoungPeople": "Stop the debt trap. Make colleges compete on value, not access to government money.",
            "forTaxpayers": "Why should plumbers subsidize philosophy degrees with poor job outcomes?"
          },
          "allies": "Fiscal conservatives, vocational education advocates, some young people",
          "opposition": "Universities, student loan industry, progressive advocates"
        }
      ]
    },
    {
      "id": "social-security-reform",
      "slug": "social-security-reform",
      "title": "Social Security Reform",
      "icon": "Briefcase",
      "color": "#F59E0B",
      "description": "Save Social Security for current retirees while giving younger workers better options.",
      "subPolicies": [
        {
          "title": "Voluntary Private Accounts for Younger Workers",
          "viability": "moderate",
          "problem": [
            "Social Security returns are negative for younger workers",
            "Trust fund going broke",
            "No ownership or inheritance of contributions",
            "Younger workers pay for current retirees with no guarantee"
          ],
          "positions": [
            "Allow workers under 40 to opt into private retirement accounts",
            "Keep Social Security for current and near-retirees",
            "Private accounts earn market returns and are inheritable",
            "Guarantee safety net for those who opt in",
            "Transition over decades"
          ],
          "framing": "Younger workers deserve ownership and better returns. Reform now to save the system."
        },
        {
          "title": "Means Testing & Benefit Adjustments",
          "viability": "low-mod",
          "problem": [
            "Wealthy retirees receive full benefits",
            "System unsustainable without changes",
            "Benefits exceed contributions for high earners"
          ],
          "positions": [
            "Reduce benefits for wealthy retirees (means testing)",
            "Raise retirement age for younger workers",
            "Adjust cost-of-living formulas",
            "Protect benefits for low- and middle-income retirees",
            "Phase in changes gradually"
          ],
          "framing": "Tough choices now prevent collapse later. Protect those who need it most."
        }
      ]
    },
    {
      "id": "tax-reform",
      "slug": "tax-reform",
      "title": "Tax Reform",
      "icon": "Receipt",
      "color": "#10B981",
      "description": "Simplify the tax code, lower rates, and eliminate special-interest loopholes.",
      "subPolicies": [
        {
          "title": "Flat or Consumption Tax",
          "viability": "low",
          "problem": [
            "Complex tax code favors those who can afford accountants",
            "Loopholes and carve-outs distort economy",
            "Income tax punishes productivity",
            "IRS enforcement burdens ordinary taxpayers"
          ],
          "positions": [
            "Replace income tax with flat tax or national sales tax (FairTax)",
            "Abolish IRS or drastically reduce its size",
            "Universal deduction to protect low earners",
            "Eliminate all deductions and credits",
            "Simplicity and transparency"
          ],
          "framing": "Tax everyone fairly at the same rate. No more loopholes, no more IRS abuses."
        },
        {
          "title": "Eliminate Carve-Outs & Special Interests",
          "viability": "moderate",
          "problem": [
            "Tax code riddled with special-interest breaks",
            "Corporations and wealthy exploit loopholes",
            "Complexity hides handouts",
            "Ordinary taxpayers pay more"
          ],
          "positions": [
            "Eliminate all corporate tax breaks and subsidies",
            "No targeted tax credits for specific industries",
            "Lower rates, broaden base",
            "Treat all income equally (wages, capital gains, dividends)",
            "Transparency in tax expenditures"
          ],
          "framing": "Lower rates for everyone—not special deals for insiders. Simplify and level the playing field."
        }
      ]
    },
    {
      "id": "drug-policy-reform",
      "slug": "drug-policy-reform",
      "title": "Drug Policy Reform",
      "icon": "Pill",
      "color": "#EF4444",
      "description": "End the failed war on drugs with evidence-based policies focused on treatment and liberty.",
      "subPolicies": [
        {
          "title": "Decriminalize & Focus on Treatment",
          "viability": "moderate",
          "problem": [
            "War on drugs has failed for 50 years",
            "Mass incarceration without reducing use",
            "Ruined lives over nonviolent offenses",
            "Lack of treatment options"
          ],
          "positions": [
            "Decriminalize personal drug possession",
            "Expand treatment and recovery programs",
            "Expunge nonviolent drug offenses",
            "Focus enforcement on trafficking and violence",
            "Treat addiction as health issue, not crime"
          ],
          "framing": "Locking people up for addiction doesn't work. Treatment saves lives."
        },
        {
          "title": "Marijuana Legalization",
          "viability": "high",
          "problem": [
            "Federal prohibition despite state legalization",
            "Arrests for marijuana use continue",
            "Lost tax revenue and economic opportunity",
            "Inconsistent laws create confusion"
          ],
          "positions": [
            "Legalize marijuana at federal level",
            "Expunge marijuana convictions",
            "Tax and regulate like alcohol",
            "Allow states to set own policies",
            "End federal interference in state-legal marijuana"
          ],
          "framing": "Marijuana prohibition has failed. Legalize, regulate, and tax it."
        }
      ]
    },
    {
      "id": "housing-reform",
      "slug": "housing-reform",
      "title": "Housing Reform",
      "icon": "Building",
      "color": "#06B6D4",
      "description": "Address the housing affordability crisis through deregulation and market-based solutions.",
      "subPolicies": [
        {
          "title": "Zoning & Land Use Reform",
          "viability": "moderate",
          "problem": [
            "Restrictive zoning limits housing supply",
            "Single-family-only zoning in most areas",
            "NIMBYism blocks new development",
            "Housing costs soar as supply constrained"
          ],
          "positions": [
            "Legalize multi-family and accessory dwelling units (ADUs)",
            "Reduce minimum lot sizes and setback requirements",
            "Expedite permitting for housing",
            "Override exclusionary zoning",
            "Let supply meet demand"
          ],
          "framing": "Build more housing, lower the cost. Zoning rules make housing unaffordable."
        },
        {
          "title": "Reduce Construction Costs & Regulations",
          "viability": "mod-high",
          "problem": [
            "Excessive building codes raise costs",
            "Environmental reviews delay projects for years",
            "Prevailing wage laws increase expenses",
            "Regulatory compliance adds 20-30% to costs"
          ],
          "positions": [
            "Streamline building codes—adopt model codes",
            "Expedite environmental reviews for housing",
            "Reform or eliminate prevailing wage mandates",
            "Allow innovative construction methods (modular, 3D printing)",
            "Cut red tape to lower costs"
          ],
          "framing": "Regulations price people out of homes. Cut the red tape and build."
        }
      ]
    }
  ]
}
